{
    "people": [
        {

            "image": "images/adolf-hitler.jpg",
            "imageSmall": "images/adolf-hitler-small.jpg",
            "imageLarge": "images/adolf-hitler-large.jpg",
            "name": "Adolf Hitler",
            "nickname": "The Fuhrer",
            "birthdate": "April 20, 1889",
            "deathdate": "April 30, 1945",
            "birthplace": "Braunau am Inn, Austria",
            "risetopower": "<p>&nbsp;Hitler always had an obsession with Germany, even though he was born in the Empire of Austria-Hungary he fought for  Imperial Germany during the First World War.</p><br><p>&nbsp; After Germany's defeat in the First World War, Hitler remained in what was left of the German Army. He was assigned to spy on one of the political parties, the German Workers Party. He quickly realized that he could add to this little party, he joined the party, and forced them to make him the Dictator for Life of the party. He changed the name to the Nationalist Socialist German Workers Party, or the Nazi Party.</p><br><p>&nbsp;After a failed attempt to illegally seize power, Hitler realized he would have to use the new Weimar Constitution to rise to power. He quickly began to gain support by feeding on the misery of the people during the Great Depression. Eventually he was elected Chancellor of Germany, and the President died, leaving a provision in his will to support Hitler, Hitler took this to mean that he should also be the President. Shortly afterwards, he gave himself dictatorial powers over Germany, and began to prepare for war.</p><br>"

    },
        {
            "image": "images/benito-mussolini.jpg",
            "imageSmall": "images/benito-mussolini-small.jpg",
            "imageLarge": "images/benito-mussolini-large.jpg",
            "name": "Benito Mussolini",
            "nickname": "Il Duce",
            "birthdate": "July 29, 1883",
            "deathdate": "Aprill 28, 1945",
            "birthplace": "Predappio, Italy",
            "risetopower": "<p>&nbsp;Mussolini's party rose to power quickly, and easily in Italy. After the First World War, although Italy had been with the victorious Allied powers, Italy still faced terrible economic trouble. Furthermore, the Soviet Union was spreading it's communist doctrine to the world, and many Italians feared Italy would too, become a communist nation.</p><br><p>&nbsp;Mussolini's party fed off of these fears, and promised to fix the economic crisis, stop the communists, and restore Italy to the glory of the Roman Empire.</p><br><p>&nbsp;Mussolini and his Black Shirt militia began their March on Rome, and when the police refused to stop them, the King of Italy gave control of the government to Mussolini, by granting him emergency powers for one year. However, Mussolini never let go of his power, and thus unwittingly, the King of Italy plunged Italy into a dictatorship that would last for twenty years.</p><br><p>&nbsp;Quickly Mussolini eliminated all opposition to his political party, and began to attempt to fix the economy. He also chose to conquer the Kingdom of Ethiopia, one of the last independent nations in Africa. The king of Ethiopia pleaded with the League of Nations for support, but other than sanctions against Italy, no support was provided.</p><br><p>&nbsp;Although initially Italy was not friendly with Nazi Germany, eventually Italy became Germany's closest ally when the war began.</p><br>"
    },
        {
            "image": "images/hirohito.jpg",
            "imageSmall": "images/hirohito-small.jpg",
            "imageLarge": "images/hirohito-large.jpg",
            "name": "Michinomiya Hirohito",
            "nickname": "Emporer of Japan",
            "birthdate": "April 29, 1901",
            "deathdate": "January 7, 1989",
            "birthplace": "Togu Palace, Tokyo, Japan",
            "risetopower": "<p>&nbsp;Hirohito himself didn't really rise to power as did the other dictators. Rather, during the 19th century, the United States introduced the power of the West to the Empire of Japan. Shortly after the Emperor overthrew the Shogun, known as the Meiji Restoration, and shortly after began to quickly westernize the Empire of Japan.</p><br><p>&nbsp;Part of Westernizing was that Japan needed to expand its borders well beyond what they currently were. Quickly Japan overran Korea at the close of the 19th century, and began a series of wars with Imperial Russia, in which Japan emerged victorious. Shortly after that Hirohito ascended the throne.</p><br><p>&nbsp;Despite these conquests, Japan was not immune to the Great Depression, forcing Japan to keep expanding her territory at the expense mostly of China. However, there was a lot of confusion because Hirohito rarely gave direct commands, rather he tried to help set up for these events to take place by firing generals and ministers. Eventually Japan controlled large portions of the Chinese coast, and in response America posed sanctions, thus forcing Japan to expand even further, leading to their part in the World War II."
    },
        {
            "image": "images/joseph-stalin.jpg",
            "imageSmall": "images/joseph-stalin-small.jpg",
            "imageLarge": "images/joseph-stalin-large.jpg",
            "name": "Joseph Stalin",
            "nickname": "Man of Steel",
            "birthdate": "December 18, 1878",
            "deathdate": "March 5, 1953",
            "birthplace": "Gori, Georgia",
            "risetopower": "<p>&nbsp;Stalin started out in a minor position in the Bolshevik party, but caught his break when Lenin, leader of the party, made Stalin Secretary General.</p><br><p>&nbsp;Stalin began to build a power base, waiting for the day when Lenin would die, and he could seize power. As the Secretary General, he had the power to appoint people loyal to him to various positions in the government, in addition to this he also could read all the files of the party, and would spend hours finding who was loyal to who and who was important. Eventually Lenin did die, and a five-year power struggle began between Stalin and Trotsky. However, Trotsky did not have the power base Stalin had, and furthermore was not nearly as popular as Stalin was. Eventually due to these handicaps Stalin won the power struggle.</p><br><p>&nbsp;Stalin quickly seized ownership of the few industrial centers not already controlled by the government, primarily the farms in the Soviet Union, and killed several who resisted. This was to counter-act the Great Depression, which was crippling the world at the time. Shortly after, he purged the military of any not loyal to him, thus creating a timid and indecisive army. He used this army to attack Finland, which turned out to be a colossal military disaster for the Soviet Union. Shortly after that, World War II began.</p><br>"
    }

    ],
    "earlyAxisVictories": [
        {
            "image": "images/german-tanks-poland.jpg",
            "battleName": "The Partitioning of Poland",
            "operationName": "Operation  Himmler",
            "casualtiesAxis": "59,000",
            "casualtiesAllied": "859,700",
            "dateBegan": "September 1, 1939",
            "dateEnded": "October 6, 1939",
            "victor": "Nazi Germany",
            "description": "<p>&nbsp;The invasion of Poland is what kicked off World War two, although it was not the first country that Hitler took over. He had already taken over Austria and Czechoslovakia by annexation and political trickery.</p><br><p>&nbsp;Hitler expected that the Western powers would do nothing when he invaded Poland, because he had signed a non-aggression treaty with the Soviet Union, so there would be no effective Eastern Front against the Germans. In fact, he went so far as to split Poland with the Soviets. However, a new Prime minister had been elected to Great Britain’s Parliament, and Winston Churchill would no longer appease Hitler, so Great Britain and France declared war on Germany.</p><br><p>&nbsp;The invasion of Poland itself was very quick, lasting just over one month, because the Germans implemented a new tactic called 'Blitzkrieg' or Lightning War. This tactic was extremely effective against the Polish army. Most of the Polish army surrendered to the Germans, hence the very high casualties.</p>"
        },
        {
            "image": "images/german-tank-norway.jpg",
            "battleName": "Conquest of Scandiavia",
            "operationName": "Weserubung",
            "casualtiesAxis": "5,318",
            "casualtiesAllied": "6,651",
            "dateBegan": "April 9, 1940",
            "dateEnded": "June 10 1940",
            "victor": "Nazi Germany",
            "description": "<p>&nbsp;At this time, Hitler received most of the metal used to make Germany's weapons from Sweden, and the Allies knew this. Although Denmark and Norway were neutral countries, Hitler knew something had to be done to protect his iron ore supply.</p><br><p>&nbsp;The Allies partially made the first move by sending expedition forces to Norway to disrupt the convoys being sent from Sweden. Hitler countered by invading Denmark and Norway.</p><br><p>&nbsp;The invasion of Denmark was brief to say the least. The Danes saw what happened in Poland, and with most of their country adjacent to Germany, knew that their tiny army had no chance, so they surrendered almost without a fight.</p><br><p>&nbsp;Norway was trickier, Allied troops from Great Britain primarily had landed and were ready to support Norway. The Germans knew that if Norway had time to prepare, they could mine the fjords leading to their primary cities, making it very difficult to invade the country. So the Germans acted quickly, they sent their ships flying the Union Jack, pretending to be British Ships, thus tricking the Norwegians into letting them into their capital city of Oslo, and taking it with little resistance.</p><br><p>&nbsp;However, the King of Norway managed to escape, and began to conduct a guerilla warfare with what was left if his army, and the British soldiers in Norther Norway.</p><br><p>&nbsp;Ironically, it was in northern Norway where the British and German soldiers first fought each other. Although their defense was admirable, eventually trouble on the western front forced the British troops to leave, leaving the rest of Norway to the Germans to overrun.</p>"
        },
        {
            "image": "images/hitler-eiffle-tower.jpg",
            "battleName": "Fall of Western Europe",
            "operationName": "Case Red",
            "casualtiesAxis": "163,676",
            "casualtiesAllied": "360,000",
            "dateBegan": "May 10, 1940",
            "dateEnded": "June 25, 1940",
            "victor": "Nazi Germany",
            "description": "<p>The French after the WW I had built a defensive line on the Franco-German border called the Maginot Line. However, the defensive wall only went to the border of neutral Belgium, and not all the way to the sea. The Belgians and Dutch were supposed to finish the wall, but instead they decided they would remain neutral, even though that did not work in WW I.</p><br><p>&nbsp;France and Britain begged them to allow troops in to defend Belgium, because it was obvious that the Germans would invade through there again, just like in WW I. But, the Belgian government refused, thinking their neutrality would stop the Germans, despite the fact that Germany had already violated the Neutrality of two countries, Denmark and Norway.</p><br><p>&nbsp;Finally, the day came and to no one’s surprise except Belgium's the German army invaded through Belgium, in order to go around the Maginot line. At last the government of Belgium pleaded for assistance from the Allies. The Allied army rushed into Belgium, only to find they played right into the hands of the Germans. Most of their army was quickly surrounded and on the run to Dunkirk. Leaving the road to Paris open and undefended to the Germans.</p><br><p>&nbsp;The Germans quickly overran Paris, and finally the Italians decided to join the war with Germany, and began an invasion of southern France, which turned out to be a disaster for the Italians.</p><br><p>&nbsp;The French quickly realized their position had become hopeless and surrendered to the Germans.</p>"
        },
        {
            "image": "images/dunkir.jpg",
            "battleName": "Miracle of Dunkirk",
            "operationName": "Operation Dynamo",
            "casualtiesAxis": "20,000",
            "casualtiesAllied": "68,111",
            "dateBegan": "May 27, 1940",
            "dateEnded": "June 4, 1940",
            "victor": "Nazi Germany",
            "description": "<p>During the Battle for France, over 400,000 Allied soldiers found themselves pinned on the beaches of Dunkirk, at the mercy of the Germans, thinking all was lost. However, Hitler made one of his great mistakes of the war, and instead of having his tanks finish off the Allied soldiers, he chose to have the airforce accomplish this, as to not give all the glory to the army.</p><br><p>&nbsp;The British scrambled together everything that could float and began to evacuate as many men as possible, even though they had to leave their weapons behind. Once Hitler realized his mistake, it was too late, he tied to advance with his tanks, but the Allies had set up a remarkable defence, and the tanks advanced slowly.</p><br><p>&nbsp;Almost all the 400,000 soliders were safley evacuated, and many of these soliders would be used in many campaigns in the future in North Africa and Normandy.</p>"
        },
        {
            "image": "images/battle-of-britain-st-paul.jpg",
            "battleName": "The Battle of Britain",
            "operationName": "Operation Sealion",
            "casualtiesAxis": "4,245",
            "casualtiesAllied": "1,964",
            "dateBegan": "July 10, 1940",
            "dateEnded": "October 31, 1940",
            "victor": "Great Britain",
            "description": "<p>After the Battle of France, Hitler tried to get Britain to give up, and stop fighting. This is often considered the darkest time of the war. Great Britain was under siege, German U-boats were sinking the desperately needed convoy ships headed to Great Britain, and the British were alone against the Nazis.</p><br><p>&nbsp;The Nazis began to make preparations to invade England, the Germans quickly realized the largest obstacle was the British Navy, and there was little chance that they would be able to match the naval power of Great Britain. Instead, they chose to wipe out the British Airforce, or the RAF, then Germany would use their air force to destroy the British navy, leaving England open to invasion.</p><br><p>&nbsp;Thus commenced the first all out air battle in history, which is why the casualties are so low, because all the fighting happened in the air. The Germans were starting to win, but then by pure chance, the British accidently bombed Berlin, which enraged Hitler to no end. He decided that instead of attacking military targets in England, he chose to bomb civilian centers.</p><br><p>&nbsp;While it was a horrific strategy, it gave the RAF the breathing room they needed to recover, and eventually beat the Germans to such and extent that the Germans would never recover from the lost aircraft. This was Hitler's first defeat, and it would not be his last.</p>"

        },
        {
            "image": "images/pearl-harbor.jpg",
            "battleName": "Attack on Pearl Harbor",
            "operationName": "Operation K",
            "casualtiesAxis": "65",
            "casualtiesAllied": "3,581",
            "dateBegan": "December 7, 1941",
            "dateEnded": "December 7, 1941",
            "victor": "Imperial Japan",
            "description": "<p>Japan needed to expand, but they knew that if they expanded further, they would have to fight the United States. A bold strategy was proposed, if a sneak attack on the port of Pearl Harbor, where most of the United States pacific fleet was, thus crippling the United States ability to effectively conduct war in the pacific, allowing the Japanese to overrun large portions of the pacific.</p><br><p>&nbsp;The Japanese prepared carefully, not even telling Hitler about the attack that was about to commence. Luckily, the American aircraft carriers were on a patrol mission away from Pearl harbor, which turned out to be fortunate, as the aircraft carrier was the most effective ship for war in the pacific.</p><br><p>&nbsp;The Japanese destroyed the fleet that was docked in Pearl Harbor, and on the same day launched assaults on Guam, Hong Kong, Singapore, the Dutch East Indies, and the Philippines.</p><br><p>&nbsp;Although the fleet was sunk, almost all the ships were fixed and used later in the way. Furthermore, the Japanese did not destroy the dry docks, or the oil reserves at Pearl Harbor, which proved to be an invaluable resource for preparing to attack the Japanese.</p>"
        }
    ],
    "turnOfTheTide": [
        {
            "image": "images/yougoslavia.jpg",
            "battleName": "Invasion of Yugoslavia",
            "operationName": "Operation 25",
            "casualtiesAxis": "4,238",
            "casualtiesAllied": "400,000",
            "dateBegan": "April 6, 1941",
            "dateEnded": "April 18, 1941",
            "victor": "Nazi Germany",
            "description": "<p>&nbsp;Yugoslavia originally supported, and was allied to Nazi Germany. However, there was a revolution, and a new anti-Nazi government was put in place. This new government lasted only one day, and the one that replaced it was again pro-Nazi. But, Hitler flew into a rage and insisted that Yugoslavia be destroyed at once.</p><br><p>&nbsp;The invasion was brief, but it cost Hitler precious time. Because he used the armies that were supposed to invade the Soviet Union to destroy the Yugoslav state. This delayed the invasion of the Soviet Union by a month, which the German generals would curse, when their armies were a month from Moscow, and the snow set in</p>"
        },
        {
            "image": "images/greece.jpg",
            "battleName": "Battle of Greece",
            "operationName": "Operation Marita",
            "casualtiesAxis": "107,200",
            "casualtiesAllied": "73,294",
            "dateBegan": "October 28, 1940",
            "dateEnded": "June 1, 1941",
            "victor": "Nazi Germany",
            "description": "<p>&nbsp;The invasion of Greece also happened at an inconvenient time. The strutting Duce of Italy felt jealous of Hitler's successful invasions, and he felt left out because Hitler never told Mussolini who or when he was going to attack. As a result, the Italian dictator decided to invade neutral Greece, and let Hitler learn about it from the news papers.</p><br><p>&nbsp;One unexpected development was that the Italian invasion was a complete disaster. It was launched from the Italian colony of Albania, and it was not long until the Greek army was pushing into Albania, chasing the routing Italian army. Hitler had little choice but to invade Greece with a fraction of the forces that the Italians used. The German armies quickly took over the country, climaxing in a paratrooper invasion of island of Crete.</p><br><p>&nbsp;Although the invasion was a success, it was unnecessary for Hitler's goals, and only helped to delay the invasion of the Soviet Unions. Condemning thousands of soldier to freeze to death in the Russian winter.</p>"
        },
        {
            "image": "images/leningrad.jpg",
            "battleName": "Siege of Leningrad",
            "operationName": "Operation Barbarossa",
            "casualtiesAxis": "579, 985",
            "casualtiesAllied": "3,436,066",
            "dateBegan": "September 8, 1941",
            "dateEnded": "January 27, 1944",
            "victor": "Soviet Union",
            "description": "<p>&nbsp;Hitler, realizing that the city of Leningrad was to heavily defended to outright capture, decided that rather than pulling soldiers from the successful army group that was preparing to attack Moscow, that it would be better to siege the city of Leningrad, and take it without use of arms.</p><br><p>&nbsp;The siege was horrific for the people of Leningrad, it lasted almost three years, and the people would have starved to death if it wasn’t for the fact that the winters would get so cold, that a river would freeze over so much that supply trucks could drive over it, earning the nickname 'The Road of Life'.</p><br><p>&nbsp;The reason why the casualties are so high is primarily because the citizens are included in the total, and also because the siege lasted for three years, giving plenty of time for millions to starve to death, rather than dying in combat.</p>"

        },
        {
            "image": "images/moscow.png",
            "battleName": "Battle of Moscow",
            "operationName": "Operation Barbarossa",
            "casualtiesAxis": "400,000",
            "casualtiesAllied": "700,000",
            "dateBegan": "October 2, 1941",
            "dateEnded": "January 7, 1942",
            "victor": "Soviet Union",
            "description": "<p>&nbsp;The Nazis were able to take large amounts of territory in the Soviet Union. The basic strategy was to have one army group take Saint Petersburg, anothe capture the Caucusus oil fields, and the final to captuer Moscow.</p><br><p>&nbsp;The most successful of these groups was the group assigned to take Moscow, however after crossing 300 kilometers, and with only 30 to go to reach the capitol, the Autumn rains began, boggin down the German army in the mud, and shortly after the snow came.</p><br><p>&nbsp;One German battalion advanced far enough to make out the spires of the Kremlin, but that same day was pushed back. The battle marked a significant turning point for the German offinsive, never again would the Germans make a serious attack on the Soviet capitol. After the attack, Hitler decided instead that when the snow melted, he would focus on the Cacusu oil fields, and the city of Stalingrad, the city of Germany's greatest defeat, and the begining of the end for the Nazi warlord.</p>"
        },
        {
            "image": "images/midway.jpg",
            "battleName": "Battle of Midway",
            "operationName": "Midway",
            "casualtiesAxis": "3,364",
            "casualtiesAllied": "307",
            "dateBegan": "June 4, 1942",
            "dateEnded": "June 7, 1942",
            "victor": "United States",
            "description": "<p>&nbsp;There was a massive Japanese fleet heading towards the island of Midway, and likely to Hawaii after that. The United States navy engaged the Japanese fleet at Midway island, and the United States almost lost the battle there and then. However, the United States had a new plane that hadn't been tested in naval combat, heavy fighters, or tactical bombers. Basically, it was half fighter, half bomber. The regular fighters had little effect on the Japanese fleet, as did the big bombers. The tactical bombers however wiped out three Japanese carriers in five minutes, the most important five minutes in the war in the pacific. The United States quickly won the battle after that, crippling the Japanese navy.</p>"
        },
        {
            "image": "images/guadalcanal.jpg",
            "battleName": "Guadalcanal Campaign",
            "operationName": "Operation Watchtower",
            "casualtiesAxis": "28,700",
            "casualtiesAllied": "14,893",
            "dateBegan": "August 7, 1942",
            "dateEnded": "February 9, 1943",
            "victor": "United States",
            "description": "<p>&nbsp;The Japanese quickly after the attack on Pearl Harbor had captured the island chain known as the Solomon Islands. At the very end of the chain was an island called Guadalcanal, on which the Japanese were planning on building an air base. The problem was if the air base was completed, and the Japanese were allowed to get a solid foothold there, the United States would not have been able to support Australia, and Japan would have likely overrun the country.</p><br><p>&nbsp;The United States needed to take the island, both to project Australia, and to have a jump off point to start attacking other Japanese held islands. The battle was bloody, but eventually the bloodiness of the battle became all to familiar to the United States Marine Corp. After the United States won, the Japanese would have few victories in the Pacific against the Americans, and from now on, it would be a very slow retreat back to Japan.</p>"

        },
        {
            "image": "images/stalingrad.jpg",
            "battleName": "Battle of Stalingrad",
            "operationName": "Winter Storm",
            "casualtiesAxis": "730,000",
            "casualtiesAllied": "1,129,619",
            "dateBegan": "August 23, 1942",
            "dateEnded": "February 2, 1943",
            "victor": "Soviet Union",
            "description": "<p>&nbsp;Considered by many historians to be the bloodiest battle in history, Stalingrad is what broke the German offensive in the Soviet Union. Stalingrad was located in a place that it would be easy to cut off access to the oil fields south of the city in the Caucasus mountains. Furthermore the propaganda value of winning the battle named after the dictator of the Soviet Union could not be understated in the minds of Hitler and Stalin.</p><br><p>&nbsp; The city was almost totally overrun in the first months of fighting, but a few small pockets of Soviet resistance held out long enough for reinforcements to arrive over the river east of the city, prolonging the attack just long enough that winter began to set in. </p><br><p>&nbsp;At this point, the German generals knew that the position the German army in Stalingrad was in grave danger of being cut off, and the generals began to plead with Hitler to allow the men to retreat, in order to save their lives. But Hitler wouldn't have it. He felt that if they started to retreat now, it would devolve into an all-out rout, and the war would be lost. He felt that if the men just pushed a little harder, fought a little longer, then they would be triumphant.</p><br><p>&nbsp;However, ultimately, Hitler was wrong. The army in Stalingrad was cut off, a rescue was attempted by another German army, but the Soviet resistance was so intense they could not reach the city, and radioed the general in Stalingrad to meet them out of the city. However, out of loyalty to Hitler, the general refused.</p><br><p>&nbsp;Hitler ordered the men in Stalingrad to fight to the last man, to the last bullet, and to never give up. To say the least, once the army was cut off, the fighting didn't last much longer. The German soldiers were freezing, starving, and in desperate need of medical supplies, while on the other hand the Soviets kept getting fresh troops almost daily. The general in charge of the attack fought to the last, and surrendered.</p>"

        },
        {
            "image": "images/el-alamein.jpg",
            "battleName": "Battle of El Alamein",
            "operationName": "Western Desert Campaign",
            "casualtiesAxis": "59,000",
            "casualtiesAllied": "13,560",
            "dateBegan": "October 23, 1942",
            "dateEnded": "Noveber 11, 1942",
            "victor": "Great Britain",
            "description": "<p>&nbsp;The war in north Africa could have easily been won by Germany earlier in the war, which would have severed the Suez canal, cutting of England from most of their empire. However, Hitler did not see any value in this at all, and refused to offer much aid to the Italian army in north Africa.</p><br><p>&nbsp;The Italian army commenced an invasion of British held Egypt, and like Greece, it was a horrific disaster. Grudgingly, Hitler sent a very small force to help, under the command of Erwin Rommel. Rommel turned out to be such a brilliant tactician, that he easily pushed the British out of Libya, and into Egypt.</p><br><p>&nbsp;Rommel's greatest enemy was, not Montgomery, the British general, but rather a crippling lack of supplies. The British had destroyed almost every Axis ship that crossed into north Africa. When the critical battle of El Alamein began, the Germans lost simply because they ran out of gas.</p><br><p>&nbsp;This defeat rendered any attempt to take control of north Africa obsolete, and the Axis powers were forced to give up the area to the Allies.</p>"
        }
    ],
    "alliedOffensive": [
        {
            "image": "images/kursk.jpg",
            "battleName": "Battle of Kursk",
            "operationName": "Operation Citadel",
            "casualtiesAxis": "198,000",
            "casualtiesAllied": "863,000",
            "dateBegan": "5 July 1943",
            "dateEnded": "16 July 1943",
            "victor": "Soviet Union",
            "description": "<p>&nbsp;The Battle of Kursk is particularly famous, as being the largest tank battle i history, with over 10,000 tanks total. After the crushing defeat at Stalingrad, and the recent invasion of Sicily, the Germans had no reserves to support the main army. The plan was to cut off a large Soviet force that had created a budge in the front, in order to do that there would be German offences in the north and south ends of the budge.</p><br><p>&nbsp;However, Soviet resistance was so stiff, the Soviets were able to stop the German offensive, which is the first time any power had been able to do that in the summer. The Germans quickly began to lose after that, this would be the last major offensive of the Germans in the Eastern Front during World War II. From now on, the Soviets would enjoy the initiative.</p>"
        },
        {
            "image": "images/invasion-of-sicily.jpg",
            "battleName": "Invasion of Sicily",
            "operationName": "Operation Husky",
            "casualtiesAxis": "218,042",
            "casualtiesAllied": "22,781",
            "dateBegan": "9 July 1943",
            "dateEnded": "17 August 1943",
            "victor": "Allies",
            "description": "<p>&nbsp;After liberating North Africa from the Axis, the next step for the Allies was the invasion of Italy, starting with Sicily. The main city that had to be captured was Messina, the city closes to the main Italian peninsula.</p><br><p>&nbsp;The Allies invaded from two different points of the island, the south-eastern coast, and the other the central southern coast. While the Axis powers tried desperately to hold onto the island, it was impossible due to the sheer size of the Allied forces.</p><br><p>&nbsp;Possible the most significant part of this battle is after the Allies took Messina, the Italians removed Mussolini from power, and the Italians joined the Allies, forcing German troops to defend the peninsula.</p>"


        },
        {
            "image": "images/peleliu.jpg",
            "battleName": "Battle of Peleliu",
            "operationName": "Operation Stalemate II",
            "casualtiesAxis": "10,695",
            "casualtiesAllied": "10,786",
            "dateBegan": "September 15 1944",
            "dateEnded": "November 27 1944",
            "victor": "Allies",
            "description": "<p>&nbsp;Peleliu was one of the bloodies battles in the Pacific for the Americans. The Japanese, as always, fought to the death and would not retreat no matter what. The battle was fought to secure an airstrip on the island that would help be a jump off point to the Philippines and other islands in the central Pacific.</p><br>&nbsp;While the battle was important, some wondered if the two months of fighting and dying was worth the small airstrip. In the end, the battle was fought to its grim conclusion.</p>"
        },
        {
            "image": "images/tarawa.jpg",
            "battleName": "Battle of Tarawa",
            "operationName": "Operation GALVANIC",
            "casualtiesAxis": "4,690",
            "casualtiesAllied": "3,110",
            "dateBegan": "November 20 1943",
            "dateEnded": "November 23 1943",
            "victor": "Allies",
            "description": "<p>&nbsp;Tarawa was the first of a series of a battles in order to liberate the Gilbert and Mariana island chains. The battle was the first that the American Marines met significant resistance on the amphibious landings, before all the landings were met with no resistance worth mentioning.</p><br><p>&nbsp;The battle was a short one, but it was an important victory that would lead to several more in the coming months.</p>"
        },
        {
            "image": "images/rome.jpg",
            "battleName": "Battle of Rome",
            "operationName": "Operation Avenger",
            "casualtiesAxis": "20,000",
            "casualtiesAllied": "55,000",
            "dateBegan": "January 17 1944",
            "dateEnded": "May 18 1944",
            "victor": "Allies",
            "description": "<p>&nbsp;The Battle of Cassino is what lead to the liberation of Rome. Little fighting actually occurred in the city of Rome, rather the battle was fought in Cassino.</p>><br><p>&nbsp;The main event of the battle happened on an abbey outside of the city on a hill build in the 6th century. The Germans were able to use the artillery extremely well, and the Allies suspected that the abbey was a place the Germans used to spot targets. The Allies marked if for destruction, and after weeks of fighting and bombing the abbey was destroyed.</p>><br><p>&nbsp;The battle was a bloody and difficult one, but after the abbey was destroyed the battle came to a rapid conclusion.</p>"
        },
        {
            "image": "images/d-day.jpg",
            "battleName": "D-Day",
            "operationName": "Operation Overlord",
            "casualtiesAxis": "9,000",
            "casualtiesAllied": "10,000",
            "dateBegan": "June 6 1944",
            "dateEnded": "June 6 1944",
            "victor": "Allies",
            "description": "<p>&nbsp;D-Day was one of the most important battles for the Allies during World War II. It was the opening up of a second front to fight Hitler’s army on land. The battle was horrifically bloody. Everything that could have gone wrong with the invasion went wrong, and it's practically a miracle the invasion was a success at all.</p><br><p>&nbsp;The Allies intended the night before the invasion to bomb several bunkers on the beach heads, and to send in hundreds of paratroopers to secure vital bridges and similar targets behind enemy lines. However, it was a cloudy night, and almost all the bombs were off target, creating crates the German soldiers could use for defense. Furthermore, the paratroopers were almost all off target, and several took a long time to take the vital points assigned to them.</p><br><p>&nbsp;The morning of the invasion also had terrible weather, and the seas were very choppy, but the invasion had already been delayed, and the longer it was delayed the worse things looked for the Allies, so the invasion was launched. One of the beaches, Omaha, was particularly bloody because the transport with all the tanks was sunk, as a result the infantry had little armor to support them in the attack on the beach.</p><br><p>&nbsp;To make matters worse, there was a German armor division not far from the beach head, and if called to action would have likely been able to stop the attack. However, due to an idiotic order from Hitler, the tanks were not used, thus saving the Allies from sure defeat.</p><br><p>&nbsp; From this defeat the liberation of Paris and all of France was quickly achieved.</p>"
        }
    ],
    "defeatOfAxis": [

        {
            "image": "images/market-garden.jpg",
            "battleName": "Operation Market Garden",
            "operationName": "Operation Market Garden",
            "casualtiesAxis": "13,000",
            "casualtiesAllied": "17,200",
            "dateBegan": "September 17 1944",
            "dateEnded": "September 25 1944",
            "victor": "Germany",
            "description": "<p>&nbsp;To say Germany was victorious in this battle is a bit of a stretch, it was more just a failed operation on the Allies part. The operation was the largest airborne operation up to that point. The goal was to surround the Ruhr valley, the center of German Industry, thus crippling Germany's ability to produce weapons.</p><br><p>&nbsp;However, as the operation began, the Germans blew up several critical bridges, forcing the main Allied army to slow down, and arrive late, giving time for a German armor division in the area to mop up most of the Allied paratroopers, thus ending the operation.</p>"
        },
        {
            "image": "images/battle-of-the-buldge.jpg",
            "battleName": "Battle of the Budge",
            "operationName": "Operation Watch of the Rhine",
            "casualtiesAxis": "125,000",
            "casualtiesAllied": "106,510",
            "dateBegan": "December 16 1944",
            "dateEnded": "January 5 1945",
            "victor": "Allies",
            "description": "<p>&nbsp;This was the last major offensive launched by the Germans during World War II. Hitler scraped the barrel to assemble the needed tanks, artillery, and oil to fuel the assault, largely at the expense of the defensive Siegfried line to the west, and reinforcements bound for the eastern front. The goal of the operation was to destroy the port of Antwerp, the main port where Allies supplies was coming through. If this port was destroyed, the nearest port after was located in far west France in a town called Brest.</p><br><p>&nbsp;The Germans had long lost air superiority in Europe, and knew that if an attack was made with clear skies, it would be a disaster, so Hitler purposely choose a time when there would be terrible storms as to render the Allied aircraft useless. Furthermore, Hitler choose the weakest point in the Allied front to penetrate, the same point he sent his army through to invade France in 1940, the Ardennes forest.</p><br><p>&nbsp;Initially things went well for the Germans, until the German army reached a critical town called Bastogne, a critical junction that the Germans needed to capture. The American forces in the city refused to give up, and fought bravely, until they were relieved by General Patton and the Third Army. Once the town was relieved, the Germans had no chance of achieving their objective, and had to retreat, loosing most of their artillery and tanks in the process, leading the complete collapse of the western front.</p>"
        },
        {
            "image": "images/manila.jpg",
            "battleName": "Liberation of Manila",
            "operationName": "Battle of Manila",
            "casualtiesAxis": "16,665",
            "casualtiesAllied": "6,575",
            "dateBegan": "February 3 1945",
            "dateEnded": "March 3 1945",
            "victor": "Allies",
            "description": "<p>&nbsp;The Battle of Manila was an important one, because its outcome determined the fate of the strategically located Philippine islands. Furthermore, it was the only major city the Japanese and American forces fought in. It is estimated that the most destroyed city, not counting Hiroshima and Nagasaki, in the war was Berlin, second was Stalingrad, and third was Manila.</p><br><p>&nbsp;The battle was terrible, and lasted a month, but after the struggle the Americans emerged victorious. During the battle the Japanese murdered hundreds of locals, destroyed local architectural and cultural heritage dating to the founding of the city.</p>"

        },
        {
            "image": "images/iwo-jima2.jpg",
            "battleName": "Battle of Iwo Jima",
            "operationName": "Operation Detachment",
            "casualtiesAxis": "18,375",
            "casualtiesAllied": "26,038",
            "dateBegan": "February 19 1945",
            "dateEnded": "March 26 1945",
            "victor": "Allies",
            "description": "<p>&nbsp;The first time that Japanese homeland had been invaded in a thousand years was Iwo Jima during World War II, and the Japanese, feeling the land was sacred, would not give up easily. The Japanese had dug intricate tunnels to defend the island from, making the invasion very difficult. The goal of this battle was to capture several air fields on the island to use to bomb the main land of Japan. However, during the fighting the airfields had been so severely damaged that they became virtually useless except for emergency landings.</p><br><p>&nbsp;This battle was unique, because American casualties were higher that Japanese, which goes to show just how hard the fighting was for the Americans. Eventually the island was taken, after the fall of Mt. Suribachi, were most of the Japanese artillery was, and from there the artillery was able to accurately hit targets.</p>"
        },
        {
            "image": "images/okinawa.jpg",
            "battleName": "Battle of Okinawa",
            "operationName": "Operation Iceberg",
            "casualtiesAxis": "117,000",
            "casualtiesAllied": "75,357",
            "dateBegan": "April 1 1945",
            "dateEnded": "June 22 1945",
            "victor": "Allies",
            "description": "<p>&nbsp;Unlike Iwo Jima, the importance of this island exceeded that of just taking airstrips from the Japanese, the plan was to use Okinawa as a staging point to invade the Japanese mainland. The island is part of the Japanese homeland, and like Iwo Jima, the fighting was very intense. It was during this battle that Germany surrendered to the Allies. However, the fighting raged on in the Pacific.</p><br><p>&nbsp;The battle was referred to as the 'typhoon of steel' in reference to all the kamikaze attacks from the Japanese. After the battle, it was discovered that almost half of the 300,000 civilians living on the island had died or committed suicide, out of fear of the Americans, which Japanese propaganda had distorted the Americans into monsters. This battle was the last major battle in the pacific between Japan and America.</p>"
        },
        {
            "image": "images/konigsberg.jpg",
            "battleName": "Battle of Königsberg",
            "operationName": "Königsberg Offensive",
            "casualtiesAxis": "264,000",
            "casualtiesAllied": "3,700",
            "dateBegan": "April 6 1945",
            "dateEnded": "April 9 1945",
            "victor": "Soviet Union",
            "description": "<p>&nbsp;Strategically speaking, the city of Königsberg was critical, as the forces in the city could easily flank the Soviet forces, therefore it was necessary to seize the city. Hitler ordered the city to be held to the last, and expected the city to deal a great deal of harm to the Soviet armies. Because since Kursk, the Germans had almost been in full retreat, and Hitler expected this little force to halt the massive Soviet army.</p><br><p>&nbsp;However, the attack was an amazing success for the Soviets, due to the amazingly small amount of casualties sustained in the battle. Hitler was furious that they didn't fight harder, but little could have been done. This opened up the front for the Soviets to push further into Germany, and on to Berlin.</p>"
        },
        {
            "image": "images/berlin.jpg",
            "battleName": "Battle of Berlin",
            "operationName": "Operation Clausewitz",
            "casualtiesAxis": "800,000",
            "casualtiesAllied": "361,367",
            "dateBegan": "April 16 1945",
            "dateEnded": "May 2 1945",
            "victor": "Soviet Union",
            "description": "<p>&nbsp;Berlin was quickly surrounded, and cut off from the rest of what was left to the Nazi empire. With Hitler in the center of the city in his Fuhrer bunker losing his mind, commanding armies that had ceased to exist some time ago, refused to give up the city. Most of the regular German soldier had been captured or killed at that point, so the Germans were forced to conscript old men, and young boys to fight and die for Hitler.</p><br><p>&nbsp;The fighting was terrible, the Germans fought to the last bullet, and often would kill themselves with their last bullet. The Soviets suffered heavy casualties in taking the city, but the Germans refused to give up, so taken they were by Hitler that they believed that he could somehow save them from this terrible situation, and still win the war. But the war was lost, and had been for months.</p><br><p>&nbsp;Hitler and many in his inner circle committed suicide, and the Germans surrendered shortly after this happened. The war in Europe was over, but Japan was still fighting in the Pacific.</p>"
        },


        {
            "image": "images/hiroshima.jpg",
            "battleName": "Atomic Bombs",
            "operationName": "Ending the War",
            "casualtiesAxis": "226,000",
            "casualtiesAllied": "20",
            "dateBegan": "August 6 1945",
            "dateEnded": "August 9 1945",
            "victor": "Allies",
            "description": "<p>&nbsp;The Allies needed Japan to surrender, but their military code would not allow the Japanese to ever surrender in war. The Allies began to make grim preparations for the invasion of Japan, knowing how after the battles of Iwo Jima and Okinawa it would be a blood bath. It is estimated that there would have been over one million American casualties alone if the invasion occurred. A new weapon had been recently developed, the atomic bomb, capable of destroying an entire city. There were only two in the American arsenal.</p><br><p>&nbsp;The first city to be destroyed was Hiroshima, and the Americans demanded the surrender of the Japanese, or they would use the weapon again. The Japanese refused, so the city of Nagasaki was also destroyed. Shortly after this the Japanese finally gave up and surrendered to the Allies, ending World War II.</p>"
        }
    ]
}
