{
    "1919-1939": [
        {

            "image": "images/adolf-hitler.jpg",
            "name": "Adolf Hitler",
            "nickname": "The Fuhrer",
            "brithdate": "April 20, 1889",
            "deathdate": "April 30, 1945",
            "birthplace": "Braunau am Inn, Austria",
            "rise-to-power": "<p>Hitler always had an obsesion with Germany, even though he was born in the Empire of Austria-Hungary he fought for  Imperial Germany during the First World War.</p><p>After Germany's defeat in the First World War, Hitler remained in what was left of the German Army. He was assigned to spy on one of hte political parites, the German Workers Party. He quickly relized that he could add to this little party, he joined the party, and forced them to make him the Dictator for Life fo the party. He changed the name to the Nationalist Socialist German Workers Party, or the Nazi Party.</p><p>After a failed attempt to illegally seize power, Hitler realized he would have to use the new Weimar Constitution to rise to power. He quickly began to gain support by feeding on the misery of the people during the Great Depression. Eventually he was elected Chancellor of Germany, and the President died, leaving a provision in his will to support Hitler, Hitler took this to mean that he should also be the President. Shortly afterwords, he gave himself dictatorial powers over Germany, and began to prepare for war.</p>"

    },
    {
        "image": "images/benito-mussolini.jpg",
        "name": "Benito Mussolini",
        "nickname": "Il Duce",
        "birthdate": "July 29, 1883",
        "deathdate": "Aprill 28, 1945",
        "birthplace": "Predappio, Italy",
        "rise-to-power": "<p>Mussolini's party rose to power quickly, and easily in Italy. After the First World War, although Italy had been with the vidtorius Allied powers, Italy still faced terrible economic trouble. Furthermore, the Soviet Untion was spreadin it's communist doctrine to the world, and many Italians feard Italy would too, become a communist nation.</p><p>Mussolini's party fed off of these fears, and promised to fix the econimc crisis, stop the communists, and restore Italy to the glory of the Roman Empire.</p><p>Mussonlin and his Black Shirt militia began their March on Rome, and when the police refused to stop them, the King of Italy gave control of the government to Mussolini, by granting him emergency powers for one year. However, Mussolini never let go of his power, and thus unwittingly, the King of Italy plunged Italy into a dictatorship that would last for twenty years.</p><p>Quickly Mussolini eliminated all opposition to his political party, and began to attempt to fix the economy. He also chose to conquer the Kingdom of Ethiopia, one of the last independent nations in Africa. The king of Ethiopia pleaded with the Leauge of Nations for support, but other than sactions against Italy, no support was provided.</p><p>Although initially Italy was not friendly with Nazi Germany, eventually italy became Germany's closest ally when the war began.</p>"
    },
    {
        "images": "images/hirohito.jpg",
        "name": "Michinomiya Hirohito",
        "nickname": "Emporer of Japan",
        "birthdate": "April 29, 1901",
        "deathdate": "January 7, 1989",
        "birthplace": "Togu Palace, Tokyo, Japan",
        "rise-to-power": "<p>Hirohito himself didn't really rise to power as did the other dictators. Rather, during the 19th century, the United States introduced the power of the West to the Empire of Japan. Shortly after the Emporer overthrew the Shogun, known as the Meiji Restoration, and shortly after began to quickly weternize the Empire of Japan.</p><p>Part of Westernizing was that Japan needed to expand its borders well beyond what they currently were. Quickly Japan overran Korea at the close of the 19th century, and began a series of wars with Imperial Russia, in which Japan emerged victorious. Shortly after that Hirohito accended the throne.</p><p>Despite these conquests, Japan was not immune to the Great Depression, forcing Japan to keep expanding her territory at the expense mostly of China. However, there was a lot of confusion because Hirohito rarely gave direct commands, rather he tired to help set up for these events to take place by firing generals and ministers. Eventually Japan controlled large portions of the Chinese coast, and in response America posed sanctions, thus forcing Japan to expand even further, leading to their part in the World War II."
    },
    {
        "image":"images/joseph-stalin.jpg",
        "name": "Joseph Stalin",
        "nickname": "Man of Steel",
        "birthdate": "December 18, 1878",
        "deathdate": "March 5, 1953",
        "birthplace": "Gori, Georgia",
        "rise-to-power": "<p>Stalin started out in a minor position in the Bolsevik party, but caught his break when Lenin, leader of hte party, made Stalin Secretary General.</p><p>Stalin began to build a power base, waiting for the day when Lenin would die, and he could seize power. As the Secretary General, he had the power to appoint people loyal to him to various posistions in the government, in addition to this he also could read all the files of the party, and would spend hours finding who was loyal to who and who was important. Eveutally Lenin did die, and a five year power struggle began between Stalin and Trotsky. However, Trotsky did not have the power base Stalin had, and further more was not nearly as popular as Stalin was. Eventually due to these handicaps Stalin won the power struggle.</p><p>Stalin quickly seized ownership of the few industrial centers not already controlled by the government, primarily the farms in the Soviet Unioon, and killed several who reseited. This was to counter-act the Great Depression, which was crippling the world at the time. Shortly after, he purged the military of any not loyal to him, thus creating a timid and indecisive army. He used this army to attakc Finland, which turned out to be a colosal military disaster for the Soviet Union. Shortly after that, World War II began.</p>"
    }

    ]
}
